kAMDSuccess = "Hiba lépett fel.";
kAMDUndefinedError = "Ismeretlen hiba lépett fel.";
kAMDBadHeaderError = "A fájl nem továbbítható.";
kAMDNoResourcesError = "Erőforrás nem foglalható le.";
kAMDReadError = "Az eszközről való olvasás nem lehetséges.";
kAMDWriteError = "Az eszközre történő írás nem lehetséges.";
kAMDUnknownPacketError = "A csomag ismeretlen.";
kAMDInvalidArgumentError = "Az argumentum érvénytelen.";
kAMDNotFoundError = "A fájl nem található.";
kAMDIsDirectoryError = "Az útvonal egy könyvtár.";
kAMDPermissionError = "Ön nem rendelkezik jogosultsággal.";
kAMDNotConnectedError = "Nem csatlakozom az eszközre.";
kAMDTimeOutError = "A művelet időtúllépése.";
kAMDOverrunError = "Puffertúlcsordulás lépett fel.";
kAMDEOFError = "Fájl vége.";
kAMDUnsupportedError = "Ez a művelet nem támogatott.";
kAMDFileExistsError = "A fájl már létezik.";
kAMDBusyError = "Az eszköz elfoglalt.";
kAMDCryptoError = "Az eszközzel nem építhető ki biztonságos kapcsolat.";
kAMDTooBigError = "Az üzenet túl nagy.";
kAMDInvalidResponseError = "Váratlan válasz érkezett az eszköztől.";
kAMDMissingKeyError = "A kulcs hiányzik.";
kAMDMissingValueError = "Az érték hiányzik.";
kAMDGetProhibitedError = "A jelszóval zárolt eszközről nem gyűjthető be érték.";
kAMDSetProhibitedError = "Az eszközön lévő érték nem állítható be.";
kAMDRemoveProhibitedError = "Az eszközön lévő érték nem távolítható el.";
kAMDImmutableValueError = "Ez az érték nem módosítható.";
kAMDPasswordProtectedError = "Az eszköz jelkóddal védett.";
kAMDMissingHostIDError = "Az eszköz nem ismeri fel ezt a hosztot.";
kAMDInvalidHostIDError = "Az eszköz nem ismeri fel ezt a hosztot.";
kAMDSessionActiveError = "A munkafolyamat aktív.";
kAMDSessionInactiveError = "A munkafolyamat inaktív.";
kAMDMissingSessionIDError = "A munkafolyamat ID hiányzik.";
kAMDInvalidSessionIDError = "A munkafolyamat ID érvénytelen.";
kAMDMissingServiceError = "A szolgáltatás hiányzik.";
kAMDInvalidServiceError = "A szolgáltatás érvénytelen.";
kAMDServiceLimitError = "Ennek a szolgáltatásnak már túl sok előfordulása fut éppen.";
kAMDCheckinSetupFailedError = "Nem indítható szolgáltatás az eszközön";
kAMDInvalidCheckinError = "Nem indítható szolgáltatás az eszközön";
kAMDCheckinTimeoutError = "A szolgáltatás nem indult el megfelelően az eszközön.";
kAMDCheckinConnectionFailedError = "A szolgáltatás nem indult el megfelelően az eszközön.";
kAMDCheckinReceiveFailedError = "A szolgáltatás nem indult el megfelelően az eszközön.";
kAMDCheckinResponseFailedError = "A szolgáltatás nem indult el megfelelően az eszközön.";
kAMDCheckinOutOfMemoryError = "A szolgáltatás nem indult el megfelelően az eszközön.";
kAMDCheckinSendFailedError = "A szolgáltatás nem indult el megfelelően az eszközön.";
kAMDMissingPairRecordError = "A hoszt nincs párosítva az eszközzel.";
kAMDInvalidPairRecordError = "A hoszt nincs többé párosítva az eszközzel.";
kAMDSavePairRecordFailedError = "A párosítási rekord nem menthető el.";
kAMDInvalidActivationRecordError = "Az aktiváló rekord nem érvényes.";
kAMDMissingActivationRecordError = "Az aktiváló rekord nem található.";
kAMDServiceProhibitedError = "A szolgáltatás nem indítható el az eszközön.";
kAMDEscrowLockedError = "Az eszköz nem lesz elérhető az indítás utáni első feloldásig.";
kAMDProhibitedBySupervision = "A művelet tiltott felügyelt eszközökön.";
kAMDPairingProhibitedError = "A párosítás csak USB-kapcsolattal engedélyezett.";
kAMDWrongDroidError = "Az eszköz helyreállítási módban van.";
kAMDSUVerificationError = "A szoftverfrissítési csomag nem ellenőrizhető vissza.";
kAMDSUPatchError = "A fájl nem foltozható.";
kAMDSUFirmwareError = "A firmware nem frissíthető.";
kAMDProvisioningProfileNotValid = "Az előkészítő profil nem érvényes.";
kAMDSendMessageError = "Az eszközre történő üzenetküldés nem lehetséges.";
kAMDReceiveMessageError = "Az eszközről történő üzenetfogadás nem lehetséges.";
kAMDMissingOptionsError = "Az opciók hiányoznak.";
kAMDMissingImageTypeError = "A kép hiányzik.";
kAMDDigestFailedError = "A lemezkép nem olvasható.";
kAMDStartServiceError = "A szolgáltatás nem indítható el.";
kAMDInvalidDiskImageError = "A lemezkép érvénytelen.";
kAMDMissingDigestError = "A kivonat hiányzik.";
kAMDMuxError = "Az USB-eszköz multiplexorával hiba lépett fel.";
kAMDApplicationAlreadyInstalledError = "Már telepítve van az eszközre egy ugyanilyen azonosítójú alkalmazás, és az nem cserélhető le.";
kAMDApplicationMoveFailedError = "Az alkalmazás nem tehető helyre az eszközön.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "Az alkalmazás nem zárható a homokozóba.";
kAMDApplicationVerificationFailedError = "Az alkalmazás nem ellenőrizhető vissza.";
kAMDArchiveDestructionFailedError = "Az alkalmazásarchívum nem távolítható el.";
kAMDBundleVerificationFailedError = "A szolgáltatócsomag nem ellenőrizhető vissza.";
kAMDCarrierBundleCopyFailedError = "A szolgáltatói csomag nem telepíthető.";
kAMDCarrierBundleDirectoryCreationFailedError = "A szolgáltató csomagkönyvtára nem hozható létre.";
kAMDCarrierBundleMissingSupportedSIMsError = "Ehhez a szolgáltatói csomaghoz nincs támogatott SIM.";
kAMDCommCenterNotificationFailedError = "A baseband értesítése nem kísérhető figyelemmel.";
kAMDContainerCreationFailedError = "Az alkalmazáskonténer nem hozható létre.";
kAMDContainerP0wnFailedError = "Az alkalmazáskonténer jogosultsága nem javítható.";
kAMDContainerRemovalFailedError = "Az alkalmazáskonténer nem távolítható el.";
kAMDEmbeddedProfileInstallFailedError = "A beágyazott előkészítő profil nem telepíthető.";
kAMDErrorError = "Hiba lépett fel.";
kAMDExecutableTwiddleFailedError = "Az alkalmazás futtatható jogosultsága nem módosítható.";
kAMDExistenceCheckFailedError = "Nem ellenőrizhető, hogy az alkalmazás létezik-e már.";
kAMDInstallMapUpdateFailedError = "A telepített alkalmazások listája nem frissíthető.";
kAMDManifestCaptureFailedError = "Az alkalmazásjegyzék nem menthető el.";
kAMDMapGenerationFailedError = "A térkép nem generálható le.";
kAMDMissingBundleExecutableError = "Az alkalmazáscsomag nem tartalmaz futtatható kódot.";
kAMDMissingBundleIdentifierError = "Az alkalmazáscsomag nem tartalmaz érvényes azonosítót.";
kAMDMissingBundlePathError = "Az alkalmazás csomagútvonala nem határozható meg.";
kAMDMissingContainerError = "A telepített alkalmazás konténere nem található.";
kAMDNotificationFailedError = "Nem küldhető értesítés.";
kAMDPackageExtractionFailedError = "Az alkalmazáscsomag nem nyitható meg.";
kAMDPackageInspectionFailedError = "Az alkalmazáscsomag nem vizsgálható át.";
kAMDPackageMoveFailedError = "Az alkalmazáscsomag nem mozgatható az átmeneti helyszínre.";
kAMDPathConversionFailedError = "Az útvonal nem konvertálható.";
kAMDRestoreContainerFailedError = "Az alkalmazáskonténer nem tölthető vissza.";
kAMDSeatbeltProfileRemovalFailedError = "Az alkalmazás biztonsági öv profilja nem távolítható el.";
kAMDStageCreationFailedError = "Az átmeneti könyvtár nem hozható létre.";
kAMDSymlinkFailedError = "A szimbolikus link nem hozható létre.";
kAMDiTunesArtworkCaptureFailedError = "Az iTunes albumborító nem menthető el.";
kAMDiTunesMetadataCaptureFailedError = "Az iTunes metaadatok nem menthetők el.";
kAMDAlreadyArchivedError = "Az alkalmazás már archiválva van.";
kAMDUnknownCommandError = "Az eszköz nem ismeri fel a parancsot.";
kAMDAPIInternalError = "Belső API-hiba lépett fel.";
kAMDMuxCreateListenerError = "Az USB-eszközök ne kísérhetők figyelemmel.";
kAMDMuxGetListenerError = "Az USB-figyelő nem szerezhető be.";
kAMDMuxConnectError = "Az eszközre való csatlakozás nem lehetséges.";
kAMDDeviceTooNewError = "Ez az alkalmazás frissítést igényel.";
kAMDDeviceRefNoGood = "Ez az eszköz már nem csatlakozik.";
kAMDDeviceDisconnectedError = "Ez az eszköz már nem csatlakozik.";
kAMDCannotTranslateError = "Az eszközről érkező üzenet nem fordítható le.";
kAMDMobileImageMounterMissingImageSignature = "A fejlesztés nem támogatható.";
kAMDMobileImageMounterResponseCreationFailed = "A fejlesztés nem támogatható.";
kAMDMobileImageMounterMissingImageType = "A fejlesztés nem támogatható.";
kAMDMobileImageMounterMissingImagePath = "A fejlesztés nem támogatható.";
kAMDMobileImageMounterImageMapLoadFailed = "A fejlesztés nem támogatható.";
kAMDMobileImageMounterAlreadyMounted = "A fejlesztés nem támogatható.";
kAMDMobileImageMounterImageMoveFailed = "A fejlesztés nem támogatható.";
kAMDMobileImageMounterMountPathMissing = "A fejlesztés nem támogatható.";
kAMDMobileImageMounterMountPathNotEmpty = "A fejlesztés nem támogatható.";
kAMDMobileImageMounterImageMountFailed = "A fejlesztés nem támogatható.";
kAMDMobileImageMounterTrustCacheLoadFailed = "A fejlesztés nem támogatható.";
kAMDMobileImageMounterDigestFailed = "A fejlesztés nem támogatható.";
kAMDMobileImageMounterDigestCreationFailed = "A fejlesztés nem támogatható.";
kAMDMobileImageMounterImageVerificationFailed = "A fejlesztés nem támogatható.";
kAMDMobileImageMounterImageInfoCreationFailed = "A fejlesztés nem támogatható.";
kAMDMobileImageMounterImageMapStoreFailed = "A fejlesztés nem támogatható.";
kAMDDeviceOSVersionTooLow = "Az eszköz OS-verziója túl alacsony.";
kAMDNoWifiSyncSupportError = "Az eszköz nem támogatja a vezeték nélküli szinkronizálást.";
kAMDDeviceFamilyNotSupported = "Ez az alkalmazás nem támogatja az ilyen típusú eszköz.";
kAMDPackagePatchFailedError = "A frissítés nem alkalmazható az alkalmazáson.";
kAMDIncorrectArchitectureError = "Ez az alkalmazás nem támogatja ennek az eszköznek a processzortípusát.";
kAMDPluginCopyFailedError = "A VPN-plugin nem másolható az alkalmazáskonténerbe.";
kAMDBreadcrumbFailedError = "A telepítési breadcrumb nem írható.";
kAMDBreadcrumbUnlockError = "A telepítési breadcrumb nem frissíthető.";
kAMDGeoJSONCaptureFailedError = "A GeoJSON-adatok nem menthetők.";
kAMDNewsstandArtworkCaptureFailedError = "Az Újságos-borító nem menthető.";
kAMDMissingCommandError = "A kérelem nem tartalmaz parancsot.";
kAMDNotEntitledError = "A kérelmező alkalmazás számára nem engedélyezett ez a kérelem.";
kAMDMissingPackagePathError = "A kérelemben hiányzik a csomagútvonal.";
kAMDMissingContainerPathError = "A kérelemben hiányzik a tárolóútvonal.";
kAMDMissingApplicationIdentifierError = "A kérelemben hiányzik az alkalmazásazonosító.";
kAMDMissingAttributeValueError = "A kérelemben hiányzik egy szükséges érték.";
kAMDLookupFailedError = "A telepített alkalmazások listája nem olvasható be.";
kAMDDictCreationFailedError = "A kérelemből nem olvashatók ki a képességek.";

/* kMISFileError */
"A file operation failed." = "Egy fájlművelet sikertelen.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "Egy aláírt erőforrás lett hozzáadva, módosítva vagy törölve.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "Nem található érvényes előkészítési profil ehhez a futtatható fájlhoz.";

/* kMISUnknownError */
"An unknown error has occurred." = "Ismeretlen hiba lépett fell.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Kísérlet történt egy megváltoztathatatlan előkészítési profil módosítására.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "Az alkalmazás nem rendelkezik érvényes aláírással.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "Az alkalmazás aláírása érvényes, de nem egyezik a várt értékkel.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "A futtatható fájl érvénytelen aláírást tartalmaz.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "A futtatható fájl érvénytelen jogosultsággal lett aláírva.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "A futtatható fájl aláírására használt identitás nem érvényes többé.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "Az aláírás nem volt érvényes.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Az eszközével való kommunikáció során hiba lépett fel.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Ez az előkészítési profil nem telepíthető erre az eszközre.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "Ez az előkészítési profil nem rendelkezik érvényes aláírással (vagy érvényes, de nem megbízható aláírással rendelkezik).";

/* kMISExpiredError */
"This provisioning profile has expired." = "Ez az előkészítési profil lejárt.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "Ez az előkészítési profil helytelen formázású.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Ez az előkészítési profil nem támogatott.";

/* kMISAllocationError */
"Unable to allocate memory." = "Nem foglalható le memória.";

